# HCP Terraform Plan Output

<!-- placeholder-1 -->
```fish
terraform plan -workspace=infrastructure
```
<!-- placeholder-2 -->

<details open><summary>Diff of 1 change.</summary>

```diff
+ module.github_organisation.github_actions_organization_variable.default will be created
```
</details>
<!-- placeholder-3 -->
<details open><summary>Plan: 1 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @AlexMan123456 at 2026-02-26T23:13:16Z [(view log)](https://github.com/alextheman231/infrastructure/actions/runs/22465286078/job/65069696053#step:4:1).
</summary>

```hcl
To view this run in a browser, visit:
https://app.terraform.io/app/alextheman/infrastructure/runs/run-5Ufs6ovt2pLzcM4D

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_organisation.github_actions_organization_variable.default will be created
  + resource "github_actions_organization_variable" "default" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + updated_at    = (known after apply)
      + value         = "30"
      + variable_name = "timeout_minutes"
      + visibility    = "all"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Run status: planned and saved (confirmable)
Workspace is unlocked
```
</details>
<!-- placeholder-5 -->
<!-- terraform-132-d5af4768b07130cf007cf09264eba2a3.tfplan -->
<!-- placeholder-6 -->